title: Suspicious PowerShell Encoded Command
id: test-rule-1
status: experimental
description: Detects encoded powershell commands using -encodedcommand
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        EventID: 4688
        CommandLine: '-encodedcommand'
    condition: selection
level: high
tags:
    - attack.execution
    - attack.t1059.001